<?php

namespace Database\Seeders;

use App\Models\Breed;
use App\Models\Species;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Log;

class BreedsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $breeds = [
            "Кошка" => ["Рэгдолл", "Экзотическая короткошерстная", "Британская короткошерстная", "Персидская кошка", "Мейн-кун"],
            "Собака" => ["Аффенпинчер", "Афганская борзая", "Эрдельтерьер", "Акита", "Аляскинский Кли Кай"],
            "Птица" => ["Страус", "Рея", "Казуар", "Эму", "Киви"],
            "Кролик" => ["Американский", "Аржантей Брюн", "Аржантей де Шампань", "Аржантей Нуар", "Аржантей Сент-Хьюберт"],
            "Рыба" => ["Рыба-меч", "Атлантическая треска", "Макрель", "Форель", "Атлантический лосось"],
            "Рептилия" => ["Американский аллигатор", "Черепаха-гофер", "Калифорнийская королевская змея", "Гила-монстр", "Дорсетская овца"],
            "Лошадь" => ["Американский дойный Девон", "Анатолийский черный", "Андалузский черный", "Ангус", "Анколь-Ватуси"],
            "Корова" => ["Американский ангус", "Американский Брахман", "Американская порода", "Американский дойный Девон", "Американский Белый Парк"],
            "Овца" => ["Баннурская овца", "Барбадосская Черная Белли", "Чевиотская овца", "Колумбийская овца", "Корридейлская овца"],
            "Коза" => ["Альпийская коза", "Бельгийская палевая коза", "ламанчская коза", "Нигерийская карликовая коза", "Оберхаслийская коза"],
            "Свинья" => ["Американская йоркширская коза", "Ангельская седельная коза", "Аппалачская английская коза", "Остров Арапава", "Арикара"],
            "Цыпленок" => ["Австралорп", "Барневельдер", "Брахма", "Кочин", "Ливорно"],
            "Утка" => ["Абакот Рейнджер", "Эйлсбери", "Бали", "Черная ост-индская", "Голубая шведская"],
            "Индейка" => ['Каштановый', 'Черный', 'Бурбонский красный', 'Бронзовый', 'Наррагансеттский'],
            "Морская свинка" => ["Абиссинская", "Американская", "Коронет", "Перуанская", "Силки"],
            "Хомяк" => ["Карлик Кэмпбелла", "Китайский", "Роборовски", "Сирийский", "Зимний белый русский карлик"],
            "Хорек" => ["Альбинос", "Черный соболь", "Шампанское", "Шоколад", "Соболь"],
            "Шиншилла" => ["Стандартный серый", "Бежевый", "Черный бархат", "Фиолетовый", "Белый"],
            "Попугай" => ["Африканский серый", "Амазонский", "Волнистый попугайчик", "Какаду"],
            "Черепаха" => ["Африканский водный попугай", "Азиатский самец", "Восточный самец", "Карта Миссисипи", "Русский"]
        ];

        foreach ($breeds as $speciesName=> $breedNames) {
            $kind = Species::where('name', $speciesName)->first();

            if(!$kind){
                Log::error($speciesName);
            }

            foreach ($breedNames as $breedName) {
                Breed::create([
                    'species_id' => $kind->id,
                    'name' => $breedName
                ]);
            }
        }
    }
}
