<template>
    <img src="/assets/about-us.png" alt="" class="aboutUs">
    О нас
    Добро пожаловать в ветеринарную клинику "Айболит"!

    Кто мы
    Мы — команда профессионалов, посвятивших свою жизнь заботе о здоровье домашних животных. Ветеринарная клиника
    "Айболит" была основана в 2005 году и с тех пор стала одним из ведущих медицинских центров для животных в Астрахани.
    Наши врачи обладают многолетним опытом и глубокой приверженностью делу, что позволяет нам предоставлять
    высококачественные медицинские услуги для ваших питомцев.

    Наша миссия
    Наша миссия — обеспечить комплексный подход к здоровью домашних животных, начиная с профилактики и заканчивая
    лечением различных заболеваний. Мы стремимся создавать дружелюбную и спокойную атмосферу, где каждый питомец и его
    владелец чувствуют себя в безопасности и получают необходимое внимание.
</template>

<script setup>

</script>

<style scoped>
.aboutUs {

}
</style>
